/*
 *    자바에서 제공하는 연산자 
 *    단항연산자 : 
 *              ++,-- (후치,전치) , !(부정) , (type) => 형변환 
 *    이항연산자 : 
 *               산술연산자 : + , - , * , / , %
 *               비교연산자 : == , != , < , > , <= , >=
 *               논리연산자 : && , || => 효율적인 연산 
 *                           false && (조건)
 *                                   ======= 처리하지 않고 false
 *                            true || (조건)
 *                                    ======(X) 
 *               대입연산자 : = , += , -=
 *               삼항연산자 : (조건) ? 값:값
 *                                === ==
 *                                true false
 *    조건문을 만들 경우 : 부정연산자 , 비교연산자 , 논리연산자
 *    ================================================
 *    활용 : 제어문 
 *    
 *    
 */
public class 자바연산자_정리 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
