/*
 *   쉬프트연산자 
 *     = 비트이동연산자  (왼쪽 << ,오른쪽 >>)
 *     = 계산 (2진법 변환) 
 *     
 *     25 << 2
 *     
 *     16+8+1
 *      11001
 *    11001() => 빈자리 0으로 채운다 
 *    1 1 0 0 1 0 0 => 100
 *                2^0
 *    64+32+4 => 100
 *    
 *    120 => 112 8 ==> 120
 *    120<<2 => 480  120*4 => 480
 *  111100000
 *  
 *     10<<3  ==> 80  1010000
 *  1010000
 *  =======
 *  16+64= 80
 *  
 *    
 *    128 64 32 16 8 4 2 0(1)
 *    10 (2진법) >> 3  1 
 *    1010
 *    
 *    25>>3
 *    11001>>3  11 => 3
 *    
 *    25>>3 
 *    
 *    왼쪽이동 (이동한 만큼 뒤에서 0을 채운다)
 *    오른쪽 이동 (이동한 만큼 뒤에서 지운다)
 *    
 *    11110000 ==> >> 3   ==> 11110
 *    
 *    1010 ==> <<3    1010000
 */
public class 자바연산자_쉬프트연산자 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		// 14 << 2 ==> 56 (14*4)
		System.out.println(14<<2);
		/*
		 *   1110  (8+4+2)
		 * 111000
		 * =======
		 * 32+16+8 ==> 56
		 */
		// 14 >> 2 ==> 14/4 ==> 3
		/*
		 *    1110
		 *      11 ==> 11 
		 *             2+1 => 3
		 *             
		 */
		System.out.println(14>>2);
		// 키보드  ( 16 / 16 ) =>   키보드값 
		System.out.println(11001>>3);
        System.out.println(0b11001>>3);
	}

}





