/*
 *    영화 => 200개 저장 (영화정보) 
 *           class Movie
 *           {
 *              저장할 데이터를 설계 
 *              => 번호 , 제목,줄거리 , 감독 , 출연, 등급 ,개봉일 , 장르, 평점
 *              => 원하는 값을 설정 (생성자 , 초기블록을 이용한다) ==> 메모리에 저장 (프로그램을 종료하면 없어진다)
 *                 => 메모리에 저장 => 각자 다르다 => 모든 데이터 공유(RDBMS:오라클)
 *              ====================================================
 *              사용자가 볼 수 있게 만든다 (요청)
 *              => 기능 
 *                 목록을 출력 
 *                 찾기 기능 
 *                 상세보기 
 *                 예매하기 
 *                 추천하기 
 *                 ======= 메소드 
 *           }
 *           
 */
public class 멤버메소드 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
